<a href="https://colab.research.google.com/github/anushirahatti/unemployment-data/blob/master/src/unemployment_data_preparation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Extraction

In [0]:
import pandas as pd

***Unemployment data of Adults basis Education Qualification.***

In [0]:
ue_primary_school = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_primary_school.csv', header=0)
ue_high_school = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_high_school.csv', header=0)
ue_associates = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_associates_degree.csv', header=0)
ue_professional = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_professional_degree.csv', header=0)

***Unemployment data of Adults basis Race.***

In [0]:
ue_white = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_white.csv', header=0)
ue_black = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_black.csv', header=0)
ue_asian = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_asian.csv', header=0)
ue_hispanic = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_hispanic.csv', header=0)

***Unemployment data of Adults basis Gender.***

In [0]:
ue_men = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_men.csv', header=0)
ue_women = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/UErate_women.csv', header=0)

**Unemployment data of Adults State Wise**

In [0]:
ue_state = pd.read_csv('https://raw.githubusercontent.com/anushirahatti/unemployment-data/master/raw_data/unemp_by_state.csv', header=0)

# Data Transformation

***Transforming extracted data in the format useful for performing Data Analysis.***

In [6]:
ue_primary_school = ue_primary_school.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="Primary_School")

ue_primary_school['Date'] = ue_primary_school['Month'].map(str) + '-' + ue_primary_school['Year'].map(str)
ue_primary_school

     Year Month  Primary_School      Date
0    2010   Jan            15.3  Jan-2010
1    2011   Jan            14.3  Jan-2011
2    2012   Jan            13.0  Jan-2012
3    2013   Jan            12.0  Jan-2013
4    2014   Jan             9.4  Jan-2014
..    ...   ...             ...       ...
127  2016   Dec             7.5  Dec-2016
128  2017   Dec             6.2  Dec-2017
129  2018   Dec             5.8  Dec-2018
130  2019   Dec             5.2  Dec-2019
131  2020   Dec             NaN  Dec-2020

[132 rows x 4 columns]

In [7]:
ue_high_school = ue_high_school.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="High_School")

ue_high_school['Date'] = ue_high_school['Month'].map(str) + '-' + ue_high_school['Year'].map(str)
ue_high_school

     Year Month  High_School      Date
0    2010   Jan         10.2  Jan-2010
1    2011   Jan          9.5  Jan-2011
2    2012   Jan          8.5  Jan-2012
3    2013   Jan          8.1  Jan-2013
4    2014   Jan          6.5  Jan-2014
..    ...   ...          ...       ...
127  2016   Dec          5.1  Dec-2016
128  2017   Dec          4.2  Dec-2017
129  2018   Dec          3.8  Dec-2018
130  2019   Dec          3.7  Dec-2019
131  2020   Dec          NaN  Dec-2020

[132 rows x 4 columns]

In [8]:
ue_associates = ue_associates.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="Associates_Degree")

ue_associates['Date'] = ue_associates['Month'].map(str) + '-' + ue_associates['Year'].map(str)
ue_associates

     Year Month  Associates_Degree      Date
0    2010   Jan                8.6  Jan-2010
1    2011   Jan                8.1  Jan-2011
2    2012   Jan                7.1  Jan-2012
3    2013   Jan                6.9  Jan-2013
4    2014   Jan                5.9  Jan-2014
..    ...   ...                ...       ...
127  2016   Dec                3.8  Dec-2016
128  2017   Dec                3.6  Dec-2017
129  2018   Dec                3.3  Dec-2018
130  2019   Dec                2.7  Dec-2019
131  2020   Dec                NaN  Dec-2020

[132 rows x 4 columns]

In [9]:
ue_professional = ue_professional.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="Professional_Degree")

ue_professional['Date'] = ue_professional['Month'].map(str) + '-' + ue_professional['Year'].map(str)
ue_professional

     Year Month  Professional_Degree      Date
0    2010   Jan                  4.9  Jan-2010
1    2011   Jan                  4.3  Jan-2011
2    2012   Jan                  4.3  Jan-2012
3    2013   Jan                  3.8  Jan-2013
4    2014   Jan                  3.3  Jan-2014
..    ...   ...                  ...       ...
127  2016   Dec                  2.5  Dec-2016
128  2017   Dec                  2.2  Dec-2017
129  2018   Dec                  2.2  Dec-2018
130  2019   Dec                  1.9  Dec-2019
131  2020   Dec                  NaN  Dec-2020

[132 rows x 4 columns]

In [10]:
ue_white = ue_white.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="White")

ue_white['Date'] = ue_white['Month'].map(str) + '-' + ue_white['Year'].map(str)
ue_white

     Year Month  White      Date
0    2010   Jan    8.8  Jan-2010
1    2011   Jan    8.1  Jan-2011
2    2012   Jan    7.4  Jan-2012
3    2013   Jan    7.1  Jan-2013
4    2014   Jan    5.7  Jan-2014
..    ...   ...    ...       ...
127  2016   Dec    4.2  Dec-2016
128  2017   Dec    3.7  Dec-2017
129  2018   Dec    3.4  Dec-2018
130  2019   Dec    3.2  Dec-2019
131  2020   Dec    NaN  Dec-2020

[132 rows x 4 columns]

In [11]:
ue_black = ue_black.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="Black")

ue_black['Date'] = ue_black['Month'].map(str) + '-' + ue_black['Year'].map(str)
ue_black

     Year Month  Black      Date
0    2010   Jan   16.5  Jan-2010
1    2011   Jan   15.8  Jan-2011
2    2012   Jan   13.6  Jan-2012
3    2013   Jan   13.7  Jan-2013
4    2014   Jan   12.1  Jan-2014
..    ...   ...    ...       ...
127  2016   Dec    7.9  Dec-2016
128  2017   Dec    6.7  Dec-2017
129  2018   Dec    6.6  Dec-2018
130  2019   Dec    5.9  Dec-2019
131  2020   Dec    NaN  Dec-2020

[132 rows x 4 columns]

In [12]:
ue_asian = ue_asian.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="Asian")

ue_asian['Date'] = ue_asian['Month'].map(str) + '-' + ue_asian['Year'].map(str)
ue_asian

     Year Month  Asian      Date
0    2010   Jan    8.3  Jan-2010
1    2011   Jan    6.8  Jan-2011
2    2012   Jan    6.7  Jan-2012
3    2013   Jan    6.4  Jan-2013
4    2014   Jan    4.7  Jan-2014
..    ...   ...    ...       ...
127  2016   Dec    2.7  Dec-2016
128  2017   Dec    2.5  Dec-2017
129  2018   Dec    3.3  Dec-2018
130  2019   Dec    2.5  Dec-2019
131  2020   Dec    NaN  Dec-2020

[132 rows x 4 columns]

In [13]:
ue_hispanic = ue_hispanic.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="Hispanic")

ue_hispanic['Date'] = ue_hispanic['Month'].map(str) + '-' + ue_hispanic['Year'].map(str)
ue_hispanic

     Year Month  Hispanic      Date
0    2010   Jan      12.9  Jan-2010
1    2011   Jan      12.3  Jan-2011
2    2012   Jan      10.7  Jan-2012
3    2013   Jan       9.7  Jan-2013
4    2014   Jan       8.3  Jan-2014
..    ...   ...       ...       ...
127  2016   Dec       5.9  Dec-2016
128  2017   Dec       5.0  Dec-2017
129  2018   Dec       4.4  Dec-2018
130  2019   Dec       4.2  Dec-2019
131  2020   Dec       NaN  Dec-2020

[132 rows x 4 columns]

In [14]:
ue_men = ue_men.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="Men")

ue_men['Date'] = ue_men['Month'].map(str) + '-' + ue_men['Year'].map(str)
ue_men

     Year Month   Men      Date
0    2010   Jan  10.2  Jan-2010
1    2011   Jan   9.0  Jan-2011
2    2012   Jan   7.7  Jan-2012
3    2013   Jan   7.5  Jan-2013
4    2014   Jan   6.2  Jan-2014
..    ...   ...   ...       ...
127  2016   Dec   4.4  Dec-2016
128  2017   Dec   3.7  Dec-2017
129  2018   Dec   3.6  Dec-2018
130  2019   Dec   3.1  Dec-2019
131  2020   Dec   NaN  Dec-2020

[132 rows x 4 columns]

In [15]:
ue_women = ue_women.melt(id_vars=["Year"], 
        var_name="Month", 
        value_name="Women")

ue_women['Date'] = ue_women['Month'].map(str) + '-' + ue_women['Year'].map(str)
ue_women

     Year Month  Women      Date
0    2010   Jan    7.9  Jan-2010
1    2011   Jan    7.9  Jan-2011
2    2012   Jan    7.6  Jan-2012
3    2013   Jan    7.2  Jan-2013
4    2014   Jan    5.8  Jan-2014
..    ...   ...    ...       ...
127  2016   Dec    4.3  Dec-2016
128  2017   Dec    3.7  Dec-2017
129  2018   Dec    3.5  Dec-2018
130  2019   Dec    3.2  Dec-2019
131  2020   Dec    NaN  Dec-2020

[132 rows x 4 columns]

In [16]:
df = ue_state.drop(['April', 'May', 'June', 'July', 'Aug.', 'Sept.', 'Oct.', 'Nov.', 'Dec.'], axis=1)

df1 = df.rename(columns={"Jan.": "Jan", "Feb.": "Feb", "March": "Mar"})

ue_state = df1.melt(id_vars=["State"], 
        var_name="Month", 
        value_name="Unemployment_Rate")

ue_state['Date'] = ue_state['Month'].map(str) + '-2020'
ue_state

             State Month  Unemployment_Rate      Date
0          Alabama   Jan                2.7  Jan-2020
1           Alaska   Jan                6.0  Jan-2020
2          Arizona   Jan                4.5  Jan-2020
3         Arkansas   Jan                3.5  Jan-2020
4       California   Jan                3.9  Jan-2020
..             ...   ...                ...       ...
151     Washington   Mar                5.1  Mar-2020
152  West Virginia   Mar                6.1  Mar-2020
153      Wisconsin   Mar                3.4  Mar-2020
154        Wyoming   Mar                3.7  Mar-2020
155    Puerto Rico   Mar                NaN  Mar-2020

[156 rows x 4 columns]

***Merging the dataframes based on columns 'Year', 'Month', and 'Date'.***

In [0]:
data1 = pd.merge(ue_primary_school, ue_high_school, on=['Date', 'Month', 'Year'])

In [0]:
data2 = pd.merge(ue_associates, ue_professional, on=['Date', 'Month', 'Year'])

In [0]:
data3 = pd.merge(ue_white, ue_black, on=['Date', 'Month', 'Year'])

In [0]:
data4 = pd.merge(ue_asian, ue_hispanic, on=['Date', 'Month', 'Year'])

In [0]:
data5 = pd.merge(ue_men, ue_women, on=['Date', 'Month', 'Year'])

In [0]:
data6 = pd.merge(data1, data2, on=['Date', 'Month', 'Year'])

In [0]:
data7 = pd.merge(data6, data3, on=['Date', 'Month', 'Year'])

In [0]:
data8 = pd.merge(data7, data4, on=['Date', 'Month', 'Year'])

In [0]:
unemployment_data = pd.merge(data8, data5, on=['Date', 'Month', 'Year'])

# Dataset for Data Analysis

In [26]:
unemployment_data.head(10)

   Year Month  Primary_School      Date  ...  Asian  Hispanic   Men  Women
0  2010   Jan            15.3  Jan-2010  ...    8.3      12.9  10.2    7.9
1  2011   Jan            14.3  Jan-2011  ...    6.8      12.3   9.0    7.9
2  2012   Jan            13.0  Jan-2012  ...    6.7      10.7   7.7    7.6
3  2013   Jan            12.0  Jan-2013  ...    6.4       9.7   7.5    7.2
4  2014   Jan             9.4  Jan-2014  ...    4.7       8.3   6.2    5.8
5  2015   Jan             8.3  Jan-2015  ...    4.0       6.7   5.3    5.0
6  2016   Jan             7.1  Jan-2016  ...    3.6       5.8   4.4    4.5
7  2017   Jan             7.4  Jan-2017  ...    3.7       5.8   4.3    4.4
8  2018   Jan             5.4  Jan-2018  ...    3.0       5.0   3.8    3.6
9  2019   Jan             5.7  Jan-2019  ...    3.1       4.8   3.7    3.6

[10 rows x 13 columns]

In [27]:
unemployment_data.tail(10)

     Year Month  Primary_School      Date  ...  Asian  Hispanic  Men  Women
122  2011   Dec            13.7  Dec-2011  ...    6.8      11.1  8.0    7.8
123  2012   Dec            11.8  Dec-2012  ...    6.6       9.6  7.2    7.4
124  2013   Dec             9.8  Dec-2013  ...    4.3       8.3  6.3    6.1
125  2014   Dec             8.6  Dec-2014  ...    4.4       6.4  5.2    5.1
126  2015   Dec             6.4  Dec-2015  ...    4.1       6.2  4.6    4.5
127  2016   Dec             7.5  Dec-2016  ...    2.7       5.9  4.4    4.3
128  2017   Dec             6.2  Dec-2017  ...    2.5       5.0  3.7    3.7
129  2018   Dec             5.8  Dec-2018  ...    3.3       4.4  3.6    3.5
130  2019   Dec             5.2  Dec-2019  ...    2.5       4.2  3.1    3.2
131  2020   Dec             NaN  Dec-2020  ...    NaN       NaN  NaN    NaN

[10 rows x 13 columns]

In [28]:
unemployment_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 132 entries, 0 to 131
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Year                 132 non-null    int64
 1   Month                132 non-null    object
 2   Primary_School       123 non-null    float64
 3   Date                 132 non-null    object
 4   High_School          123 non-null    float64
 5   Associates_Degree    123 non-null    float64
 6   Professional_Degree  123 non-null    float64
 7   White                123 non-null    float64
 8   Black                123 non-null    float64
 9   Asian                123 non-null    float64
 10  Hispanic             123 non-null    float64
 11  Men                  123 non-null    float64
 12  Women                123 non-null    float64
dtypes: float64(10), int64(1), object(2)
memory usage: 14.4+ KB

In [29]:
ue_state.head(10)

         State Month  Unemployment_Rate      Date
0      Alabama   Jan                2.7  Jan-2020
1       Alaska   Jan                6.0  Jan-2020
2      Arizona   Jan                4.5  Jan-2020
3     Arkansas   Jan                3.5  Jan-2020
4   California   Jan                3.9  Jan-2020
5     Colorado   Jan                2.5  Jan-2020
6  Connecticut   Jan                3.7  Jan-2020
7     Delaware   Jan                4.0  Jan-2020
8         D.C.   Jan                5.2  Jan-2020
9      Florida   Jan                2.8  Jan-2020

In [30]:
ue_state.tail(10)

             State Month  Unemployment_Rate      Date
146      Tennessee   Mar                3.5  Mar-2020
147          Texas   Mar                4.7  Mar-2020
148           Utah   Mar                3.6  Mar-2020
149        Vermont   Mar                3.2  Mar-2020
150       Virginia   Mar                3.3  Mar-2020
151     Washington   Mar                5.1  Mar-2020
152  West Virginia   Mar                6.1  Mar-2020
153      Wisconsin   Mar                3.4  Mar-2020
154        Wyoming   Mar                3.7  Mar-2020
155    Puerto Rico   Mar                NaN  Mar-2020

In [31]:
ue_state.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   State              156 non-null    object
 1   Month              156 non-null    object
 2   Unemployment_Rate  155 non-null    float64
 3   Date               156 non-null    object
dtypes: float64(1), object(3)
memory usage: 5.0+ KB